test_results/sqlx/load/2.txt
     ✓ register | invalid payload | should return 400
     ✓ register | register with correct payload | should return 201
     ✓ register | register with correct payload | should return have a userId
     ✓ register | register with correct payload | should return have a nip
     ✓ register | register with correct payload | should return have a name
     ✓ register | register with correct payload | should return have an accessToken
     ✓ register | register with existing nip | should return 409
     ✗ login | login with correct payload | should return 200
      ↳  93% — ✓ 2563 / ✗ 171
     ✗ login | login with correct payload | should return have a userId
      ↳  93% — ✓ 2563 / ✗ 171
     ✗ login | login with correct payload | should return have a nip
      ↳  93% — ✓ 2563 / ✗ 171
     ✗ login | login with correct payload | should return have a name
      ↳  93% — ✓ 2563 / ✗ 171
     ✗ login | login with correct payload | should return have an accessToken
      ↳  93% — ✓ 2563 / ✗ 171
     ✓ nurse management post | register with correct payload | should return 201
     ✓ nurse management post | register with correct payload | should return have a userId
     ✓ nurse management post | register with correct payload | should return have a nip
     ✓ nurse management post | register with correct payload | should return have a name
     ✗ nurse management get | get all users | should return 200
      ↳  99% — ✓ 48531 / ✗ 1
     ✗ nurse management get | get all users | should all have a userId
      ↳  99% — ✓ 48531 / ✗ 1
     ✗ nurse management get | get all users | should all have a nip
      ↳  99% — ✓ 48531 / ✗ 1
     ✗ nurse management get | get all users | should all have a name
      ↳  99% — ✓ 48531 / ✗ 1
     ✗ nurse management get | get all users | should all have a createdAt
      ↳  99% — ✓ 48531 / ✗ 1
     ✗ nurse management get | get all users | should not have more than 5 result
      ↳  99% — ✓ 48531 / ✗ 1
     ✗ nurse management get | get all users | should have createdAt and format should be date
      ↳  99% — ✓ 48531 / ✗ 1
     ✗ nurse management get | get all users with name | should return 200
      ↳  99% — ✓ 48528 / ✗ 3
     ✗ nurse management get | get all users with name | should all have a userId
      ↳  99% — ✓ 48528 / ✗ 3
     ✗ nurse management get | get all users with name | should all have a nip
      ↳  99% — ✓ 48528 / ✗ 3
     ✗ nurse management get | get all users with name | should all have a name
      ↳  99% — ✓ 48528 / ✗ 3
     ✗ nurse management get | get all users with name | should all have a createdAt
      ↳  99% — ✓ 48528 / ✗ 3
     ✗ nurse management get | get all users with name | should not have more than 5 result
      ↳  99% — ✓ 48528 / ✗ 3
     ✗ nurse management get | get all users with name | should have createdAt and format should be date
      ↳  99% — ✓ 48528 / ✗ 3
     ✗ nurse management get | get all users with name | should have result with "a" in it
      ↳  99% — ✓ 48528 / ✗ 3
     ✗ nurse management get | get all users with nip | should return 200
      ↳  99% — ✓ 48526 / ✗ 2
     ✗ nurse management get | get all users with nip | should all have a userId
      ↳  99% — ✓ 48526 / ✗ 2
     ✗ nurse management get | get all users with nip | should all have a nip
      ↳  99% — ✓ 48526 / ✗ 2
     ✗ nurse management get | get all users with nip | should all have a name
      ↳  99% — ✓ 48526 / ✗ 2
     ✗ nurse management get | get all users with nip | should all have a createdAt
      ↳  99% — ✓ 48526 / ✗ 2
     ✗ nurse management get | get all users with nip | should not have more than 5 result
      ↳  99% — ✓ 48526 / ✗ 2
     ✗ nurse management get | get all users with nip | should have createdAt and format should be date
      ↳  99% — ✓ 48526 / ✗ 2
     ✗ nurse management get | get all users with nip | should have result with four digit of searched nip in it
      ↳  99% — ✓ 48526 / ✗ 2
     ✗ nurse management get | get all users with it role | should return 200
      ↳  99% — ✓ 48525 / ✗ 1
     ✗ nurse management get | get all users with it role | should all have a userId
      ↳  99% — ✓ 48525 / ✗ 1
     ✗ nurse management get | get all users with it role | should all have a nip
      ↳  99% — ✓ 48525 / ✗ 1
     ✗ nurse management get | get all users with it role | should all have a name
      ↳  99% — ✓ 48525 / ✗ 1
     ✗ nurse management get | get all users with it role | should all have a createdAt
      ↳  99% — ✓ 48525 / ✗ 1
     ✗ nurse management get | get all users with it role | should have createdAt and format should be date
      ↳  99% — ✓ 48525 / ✗ 1
     ✗ nurse management get | get all users with it role | should not have more than 5 result
      ↳  99% — ✓ 48525 / ✗ 1
     ✗ nurse management get | get all users with it role | should have all nip that starts with 615
      ↳  99% — ✓ 48525 / ✗ 1
     ✗ nurse management get | get all users with nurse role | should return 200
      ↳  99% — ✓ 48518 / ✗ 7
     ✗ nurse management get | get all users with nurse role | should all have a userId
      ↳  99% — ✓ 48518 / ✗ 7
     ✗ nurse management get | get all users with nurse role | should all have a nip
      ↳  99% — ✓ 48518 / ✗ 7
     ✗ nurse management get | get all users with nurse role | should all have a name
      ↳  99% — ✓ 48518 / ✗ 7
     ✗ nurse management get | get all users with nurse role | should all have a createdAt
      ↳  99% — ✓ 48518 / ✗ 7
     ✗ nurse management get | get all users with nurse role | should have createdAt and format should be date
      ↳  99% — ✓ 48518 / ✗ 7
     ✗ nurse management get | get all users with nurse role | should not have more than 5 result
      ↳  99% — ✓ 48518 / ✗ 7
     ✗ nurse management get | get all users with nurse role | should have all nip that starts with 303
      ↳  99% — ✓ 48518 / ✗ 7
     ✗ nurse management get | get all users with createdAt asc | should return 200
      ↳  99% — ✓ 48516 / ✗ 2
     ✗ nurse management get | get all users with createdAt asc | should all have a userId
      ↳  99% — ✓ 48516 / ✗ 2
     ✗ nurse management get | get all users with createdAt asc | should all have a nip
      ↳  99% — ✓ 48516 / ✗ 2
     ✗ nurse management get | get all users with createdAt asc | should all have a name
      ↳  99% — ✓ 48516 / ✗ 2
     ✗ nurse management get | get all users with createdAt asc | should all have a createdAt
      ↳  99% — ✓ 48516 / ✗ 2
     ✗ nurse management get | get all users with createdAt asc | should have createdAt and format should be date
      ↳  99% — ✓ 48516 / ✗ 2
     ✗ nurse management get | get all users with createdAt asc | should not have more than 5 result
      ↳  99% — ✓ 48516 / ✗ 2
     ✗ nurse management get | get all users with createdAt asc | should have return ordered by oldest first
      ↳  99% — ✓ 48516 / ✗ 2
     ✗ nurse management get | get all users with limit | should return 200
      ↳  99% — ✓ 48513 / ✗ 3
     ✗ nurse management get | get all users with limit | should all have a userId
      ↳  99% — ✓ 48513 / ✗ 3
     ✗ nurse management get | get all users with limit | should all have a nip
      ↳  99% — ✓ 48513 / ✗ 3
     ✗ nurse management get | get all users with limit | should all have a name
      ↳  99% — ✓ 48513 / ✗ 3
     ✗ nurse management get | get all users with limit | should all have a createdAt
      ↳  99% — ✓ 48513 / ✗ 3
     ✗ nurse management get | get all users with limit | should have createdAt and format should be date
      ↳  99% — ✓ 48513 / ✗ 3
     ✗ nurse management get | get all users with limit | should not have more than 2 result
      ↳  99% — ✓ 48513 / ✗ 3
     ✓ nurse management put | get all users with nurse role | should return 200
     ✓ nurse management put | get all users with it role | should return 200
     ✓ nurse management put | editing nurse | should return 200
     ✓ nurse management put | get user by userId after edit | should return 200
     ✓ nurse management put | get user by userId after edit | should all have a userId
     ✓ nurse management put | get user by userId after edit | should have the same nip after edit
     ✓ nurse management put | get user by userId after edit | should have the same name after edit
     ✓ nurse management delete | get all users with nurse role | should return 200
     ✓ nurse management delete | get all users with it role | should return 200
     ✓ nurse management delete | no header | should return 401
     ✓ nurse management delete | no path value | should return 404
     ✓ nurse management delete | deleting an it | should return 404
     ✗ nurse management delete | deleting nurse | should return 200
      ↳  98% — ✓ 132 / ✗ 2
     ✓ nurse management delete | get user by userId after edit | should return 200
     ✓ nurse management delete | get user by userId after edit | should have no data
     ✓ nurse management access post | get all users with nurse role | should return 200
     ✓ nurse management access post | invalid payload | should return 400
     ✗ nurse management access post | give nurse access | should return 200
      ↳  96% — ✓ 267 / ✗ 9
     ✗ nurse management login | login with correct payload | should return 200
      ↳  78% — ✓ 1785 / ✗ 477
     ✗ image post |  | image post | correct file should return 200
      ↳  75% — ✓ 1339 / ✗ 446
     ✗ image post |  | image post | correct file should have imageUrl
      ↳  75% — ✓ 1339 / ✗ 446
     ✗ medical patient post | add medical patient | should return 201
      ↳  97% — ✓ 3177 / ✗ 71
     ✗ medical record post | get all patient | should return 200
      ↳  99% — ✓ 2110 / ✗ 17
     ✗ medical record post | add medical record | should return 201
      ↳  99% — ✓ 2095 / ✗ 15
     ✗ medical patient get | get all patient | should return 200
      ↳  99% — ✓ 7860 / ✗ 6
     ✗ medical patient get | get all patient | should all have a identityNumber
      ↳  99% — ✓ 7860 / ✗ 6
     ✗ medical patient get | get all patient | should all have phoneNumber
      ↳  99% — ✓ 7860 / ✗ 6
     ✗ medical patient get | get all patient | should all have a name
      ↳  99% — ✓ 7860 / ✗ 6
     ✗ medical patient get | get all patient | should have birthDate and format should be date
      ↳  99% — ✓ 7860 / ✗ 6
     ✗ medical patient get | get all patient | should all have gender
      ↳  99% — ✓ 7860 / ✗ 6
     ✗ medical patient get | get all patient | should all have a createdAt
      ↳  99% — ✓ 7860 / ✗ 6
     ✗ medical patient get | get all patient | should have createdAt and format should be date
      ↳  99% — ✓ 7860 / ✗ 6
     ✗ medical patient get | get all patient | should not have more than 5 result
      ↳  99% — ✓ 7860 / ✗ 6
     ✗ medical patient get | get all patient with name | should return 200
      ↳  99% — ✓ 7853 / ✗ 7
     ✗ medical patient get | get all patient with name | should all have a identityNumber
      ↳  99% — ✓ 7853 / ✗ 7
     ✗ medical patient get | get all patient with name | should all have phoneNumber
      ↳  99% — ✓ 7853 / ✗ 7
     ✗ medical patient get | get all patient with name | should all have a name
      ↳  99% — ✓ 7853 / ✗ 7
     ✗ medical patient get | get all patient with name | should have birthDate and format should be date
      ↳  99% — ✓ 7853 / ✗ 7
     ✗ medical patient get | get all patient with name | should all have gender
      ↳  99% — ✓ 7853 / ✗ 7
     ✗ medical patient get | get all patient with name | should all have a createdAt
      ↳  99% — ✓ 7853 / ✗ 7
     ✗ medical patient get | get all patient with name | should have createdAt and format should be date
      ↳  99% — ✓ 7853 / ✗ 7
     ✗ medical patient get | get all patient with name | should not have more than 5 result
      ↳  99% — ✓ 7853 / ✗ 7
     ✗ medical patient get | get all patient with name | should have result with "a" in it
      ↳  99% — ✓ 7853 / ✗ 7
     ✗ medical patient get | get all patient with phoneNumber | should return 200
      ↳  99% — ✓ 7848 / ✗ 5
     ✗ medical patient get | get all patient with phoneNumber | should all have a identityNumber
      ↳  99% — ✓ 7848 / ✗ 5
     ✗ medical patient get | get all patient with phoneNumber | should all have phoneNumber
      ↳  99% — ✓ 7848 / ✗ 5
     ✗ medical patient get | get all patient with phoneNumber | should all have a name
      ↳  99% — ✓ 7848 / ✗ 5
     ✗ medical patient get | get all patient with phoneNumber | should have birthDate and format should be date
      ↳  99% — ✓ 7848 / ✗ 5
     ✗ medical patient get | get all patient with phoneNumber | should all have gender
      ↳  99% — ✓ 7848 / ✗ 5
     ✗ medical patient get | get all patient with phoneNumber | should all have a createdAt
      ↳  99% — ✓ 7848 / ✗ 5
     ✗ medical patient get | get all patient with phoneNumber | should have createdAt and format should be date
      ↳  99% — ✓ 7848 / ✗ 5
     ✗ medical patient get | get all patient with phoneNumber | should not have more than 5 result
      ↳  99% — ✓ 7848 / ✗ 5
     ✗ medical patient get | get all patient with phoneNumber | should have result with four digit of searched phoneNumber in it
      ↳  99% — ✓ 7848 / ✗ 5
     ✗ medical patient get | get all patient with createdAt asc | should return 200
      ↳  99% — ✓ 7838 / ✗ 10
     ✗ medical patient get | get all patient with createdAt asc | should all have a identityNumber
      ↳  99% — ✓ 7838 / ✗ 10
     ✗ medical patient get | get all patient with createdAt asc | should all have phoneNumber
      ↳  99% — ✓ 7838 / ✗ 10
     ✗ medical patient get | get all patient with createdAt asc | should all have a name
      ↳  99% — ✓ 7838 / ✗ 10
     ✗ medical patient get | get all patient with createdAt asc | should have birthDate and format should be date
      ↳  99% — ✓ 7838 / ✗ 10
     ✗ medical patient get | get all patient with createdAt asc | should all have gender
      ↳  99% — ✓ 7838 / ✗ 10
     ✗ medical patient get | get all patient with createdAt asc | should all have a createdAt
      ↳  99% — ✓ 7838 / ✗ 10
     ✗ medical patient get | get all patient with createdAt asc | should have createdAt and format should be date
      ↳  99% — ✓ 7838 / ✗ 10
     ✗ medical patient get | get all patient with createdAt asc | should not have more than 5 result
      ↳  99% — ✓ 7838 / ✗ 10
     ✗ medical patient get | get all patient with createdAt asc | should have return ordered by oldest first
      ↳  99% — ✓ 7838 / ✗ 10
     ✗ medical patient get | get all patient with limit | should return 200
      ↳  99% — ✓ 7825 / ✗ 13
     ✗ medical patient get | get all patient with limit | should all have a identityNumber
      ↳  99% — ✓ 7825 / ✗ 13
     ✗ medical patient get | get all patient with limit | should all have phoneNumber
      ↳  99% — ✓ 7825 / ✗ 13
     ✗ medical patient get | get all patient with limit | should all have a name
      ↳  99% — ✓ 7825 / ✗ 13
     ✗ medical patient get | get all patient with limit | should have birthDate and format should be date
      ↳  99% — ✓ 7825 / ✗ 13
     ✗ medical patient get | get all patient with limit | should all have gender
      ↳  99% — ✓ 7825 / ✗ 13
     ✗ medical patient get | get all patient with limit | should all have a createdAt
      ↳  99% — ✓ 7825 / ✗ 13
     ✗ medical patient get | get all patient with limit | should have createdAt and format should be date
      ↳  99% — ✓ 7825 / ✗ 13
     ✗ medical patient get | get all patient with limit | should not have more than 2 result
      ↳  99% — ✓ 7825 / ✗ 13
     ✗ medical record get | get all record | should return 200
      ↳  99% — ✓ 6001 / ✗ 56
     ✗ medical record get | get all record | should all have a identityDetail
      ↳  99% — ✓ 6001 / ✗ 56
     ✗ medical record get | get all record | should all have a identityDetail.identityNumber
      ↳  99% — ✓ 6001 / ✗ 56
     ✗ medical record get | get all record | should all have a identityDetail.phoneNumber
      ↳  99% — ✓ 6001 / ✗ 56
     ✗ medical record get | get all record | should all have a identityDetail.name
      ↳  99% — ✓ 6001 / ✗ 56
     ✗ medical record get | get all record | should all have a identityDetail.birthDate and the format should be date
      ↳  99% — ✓ 6001 / ✗ 56
     ✗ medical record get | get all record | should all have a identityDetail.gender
      ↳  99% — ✓ 6001 / ✗ 56
     ✗ medical record get | get all record | should all have a identityDetail.identityCardScanImg
      ↳  99% — ✓ 6001 / ✗ 56
     ✗ medical record get | get all record | should all have a symptoms
      ↳  99% — ✓ 6001 / ✗ 56
     ✗ medical record get | get all record | should all have a medications
      ↳  99% — ✓ 6001 / ✗ 56
     ✗ medical record get | get all record | should all have a createdBy
      ↳  99% — ✓ 6001 / ✗ 56
     ✗ medical record get | get all record | should all have a createdBy.nip
      ↳  99% — ✓ 6001 / ✗ 56
     ✗ medical record get | get all record | should all have a createdBy.name
      ↳  99% — ✓ 6001 / ✗ 56
     ✗ medical record get | get all record | should all have a createdBy.userId
      ↳  99% — ✓ 6001 / ✗ 56
     ✗ medical record get | get all record | should have createdAt and format should be date
      ↳  99% — ✓ 6001 / ✗ 56
     ✗ medical record get | get all record | should not have more than 5 result
      ↳  99% — ✓ 6001 / ✗ 56
     ✗ medical record get | get all record with createdBy.userId | should return 200
      ↳  99% — ✓ 5979 / ✗ 22
     ✗ medical record get | get all record with createdBy.userId | should all have a identityDetail
      ↳  99% — ✓ 5979 / ✗ 22
     ✗ medical record get | get all record with createdBy.userId | should all have a identityDetail.identityNumber
      ↳  99% — ✓ 5979 / ✗ 22
     ✗ medical record get | get all record with createdBy.userId | should all have a identityDetail.phoneNumber
      ↳  99% — ✓ 5979 / ✗ 22
     ✗ medical record get | get all record with createdBy.userId | should all have a identityDetail.name
      ↳  99% — ✓ 5979 / ✗ 22
     ✗ medical record get | get all record with createdBy.userId | should all have a identityDetail.birthDate and the format should be date
      ↳  99% — ✓ 5979 / ✗ 22
     ✗ medical record get | get all record with createdBy.userId | should all have a identityDetail.gender
      ↳  99% — ✓ 5979 / ✗ 22
     ✗ medical record get | get all record with createdBy.userId | should all have a identityDetail.identityCardScanImg
      ↳  99% — ✓ 5979 / ✗ 22
     ✗ medical record get | get all record with createdBy.userId | should all have a symptoms
      ↳  99% — ✓ 5979 / ✗ 22
     ✗ medical record get | get all record with createdBy.userId | should all have a medications
      ↳  99% — ✓ 5979 / ✗ 22
     ✗ medical record get | get all record with createdBy.userId | should all have a createdBy
      ↳  99% — ✓ 5979 / ✗ 22
     ✗ medical record get | get all record with createdBy.userId | should all have a createdBy.name
      ↳  99% — ✓ 5979 / ✗ 22
     ✗ medical record get | get all record with createdBy.userId | should all have a createdBy.nip
      ↳  99% — ✓ 5979 / ✗ 22
     ✗ medical record get | get all record with createdBy.userId | should all have a createdBy.userId
      ↳  99% — ✓ 5979 / ✗ 22
     ✗ medical record get | get all record with createdBy.userId | should have createdAt and format should be date
      ↳  99% — ✓ 5979 / ✗ 22
     ✗ medical record get | get all record with createdBy.userId | should not have more than 5 result
      ↳  49% — ✓ 2971 / ✗ 3030
     ✗ medical record get | get all record with nip | should return 200
      ↳  99% — ✓ 5959 / ✗ 20
     ✗ medical record get | get all record with nip | should all have a identityDetail
      ↳  99% — ✓ 5959 / ✗ 20
     ✗ medical record get | get all record with nip | should all have a identityDetail.identityNumber
      ↳  99% — ✓ 5959 / ✗ 20
     ✗ medical record get | get all record with nip | should all have a identityDetail.phoneNumber
      ↳  99% — ✓ 5959 / ✗ 20
     ✗ medical record get | get all record with nip | should all have a identityDetail.name
      ↳  99% — ✓ 5959 / ✗ 20
     ✗ medical record get | get all record with nip | should all have a identityDetail.birthDate and the format should be date
      ↳  99% — ✓ 5959 / ✗ 20
     ✗ medical record get | get all record with nip | should all have a identityDetail.gender
      ↳  99% — ✓ 5959 / ✗ 20
     ✗ medical record get | get all record with nip | should all have a identityDetail.identityCardScanImg
      ↳  99% — ✓ 5959 / ✗ 20
     ✗ medical record get | get all record with nip | should all have a symptoms
      ↳  99% — ✓ 5959 / ✗ 20
     ✗ medical record get | get all record with nip | should all have a medications
      ↳  99% — ✓ 5959 / ✗ 20
     ✗ medical record get | get all record with nip | should all have a createdBy
      ↳  99% — ✓ 5959 / ✗ 20
     ✗ medical record get | get all record with nip | should all have a createdBy.name
      ↳  99% — ✓ 5959 / ✗ 20
     ✗ medical record get | get all record with nip | should all have a createdBy.nip
      ↳  99% — ✓ 5959 / ✗ 20
     ✗ medical record get | get all record with nip | should all have a createdBy.userId
      ↳  99% — ✓ 5959 / ✗ 20
     ✗ medical record get | get all record with nip | should have createdAt and format should be date
      ↳  99% — ✓ 5959 / ✗ 20
     ✗ medical record get | get all record with nip | should not have more than 5 result
      ↳  99% — ✓ 5959 / ✗ 20
     ✗ medical record get | get all record with createdAt asc | should return 200
      ↳  99% — ✓ 5947 / ✗ 12
     ✗ medical record get | get all record with createdAt asc | should all have a identityDetail
      ↳  99% — ✓ 5947 / ✗ 12
     ✗ medical record get | get all record with createdAt asc | should all have a identityDetail.identityNumber
      ↳  99% — ✓ 5947 / ✗ 12
     ✗ medical record get | get all record with createdAt asc | should all have a identityDetail.phoneNumber
      ↳  99% — ✓ 5947 / ✗ 12
     ✗ medical record get | get all record with createdAt asc | should all have a identityDetail.name
      ↳  99% — ✓ 5947 / ✗ 12
     ✗ medical record get | get all record with createdAt asc | should all have a identityDetail.birthDate and the format should be date
      ↳  99% — ✓ 5947 / ✗ 12
     ✗ medical record get | get all record with createdAt asc | should all have a identityDetail.gender
      ↳  99% — ✓ 5947 / ✗ 12
     ✗ medical record get | get all record with createdAt asc | should all have a identityDetail.identityCardScanImg
      ↳  99% — ✓ 5947 / ✗ 12
     ✗ medical record get | get all record with createdAt asc | should all have a symptoms
      ↳  99% — ✓ 5947 / ✗ 12
     ✗ medical record get | get all record with createdAt asc | should all have a medications
      ↳  99% — ✓ 5947 / ✗ 12
     ✗ medical record get | get all record with createdAt asc | should all have a createdBy
      ↳  99% — ✓ 5947 / ✗ 12
     ✗ medical record get | get all record with createdAt asc | should all have a createdBy.name
      ↳  99% — ✓ 5947 / ✗ 12
     ✗ medical record get | get all record with createdAt asc | should all have a createdBy.nip
      ↳  99% — ✓ 5947 / ✗ 12
     ✗ medical record get | get all record with createdAt asc | should all have a createdBy.userId
      ↳  99% — ✓ 5947 / ✗ 12
     ✗ medical record get | get all record with createdAt asc | should have createdAt and format should be date
      ↳  99% — ✓ 5947 / ✗ 12
     ✗ medical record get | get all record with createdAt asc | should not have more than 5 result
      ↳  99% — ✓ 5947 / ✗ 12
     ✗ medical record get | get all record with createdAt asc | should have return ordered by oldest first
      ↳  99% — ✓ 5947 / ✗ 12
     ✗ medical record get | get all record with limit | should return 200
      ↳  99% — ✓ 5944 / ✗ 3
     ✗ medical record get | get all record with limit | should all have a identityDetail
      ↳  99% — ✓ 5944 / ✗ 3
     ✗ medical record get | get all record with limit | should all have a identityDetail.identityNumber
      ↳  99% — ✓ 5944 / ✗ 3
     ✗ medical record get | get all record with limit | should all have a identityDetail.phoneNumber
      ↳  99% — ✓ 5944 / ✗ 3
     ✗ medical record get | get all record with limit | should all have a identityDetail.name
      ↳  99% — ✓ 5944 / ✗ 3
     ✗ medical record get | get all record with limit | should all have a identityDetail.birthDate and the format should be date
      ↳  99% — ✓ 5944 / ✗ 3
     ✗ medical record get | get all record with limit | should all have a identityDetail.gender
      ↳  99% — ✓ 5944 / ✗ 3
     ✗ medical record get | get all record with limit | should all have a identityDetail.identityCardScanImg
      ↳  99% — ✓ 5944 / ✗ 3
     ✗ medical record get | get all record with limit | should all have a symptoms
      ↳  99% — ✓ 5944 / ✗ 3
     ✗ medical record get | get all record with limit | should all have a medications
      ↳  99% — ✓ 5944 / ✗ 3
     ✗ medical record get | get all record with limit | should all have a createdBy
      ↳  99% — ✓ 5944 / ✗ 3
     ✗ medical record get | get all record with limit | should all have a createdBy.name
      ↳  99% — ✓ 5944 / ✗ 3
     ✗ medical record get | get all record with limit | should all have a createdBy.nip
      ↳  99% — ✓ 5944 / ✗ 3
     ✗ medical record get | get all record with limit | should all have a createdBy.userId
      ↳  99% — ✓ 5944 / ✗ 3
     ✗ medical record get | get all record with limit | should have createdAt and format should be date
      ↳  99% — ✓ 5944 / ✗ 3
     ✗ medical record get | get all record with limit | should not have more than 2 result
      ↳  99% — ✓ 5944 / ✗ 3
     ✓ nurse management post | no header | should return 401
     ✓ nurse management post | no payload | should return 400
     ✓ nurse management post | invalid payload | should return 400
     ✓ image post |  | image post | post upload file empty auth should return 401
     ✓ image post |  | image post | post upload file empty file should return 400
     ✓ nurse management put | no header | should return 401
     ✓ nurse management put | no path value | should return 404
     ✓ nurse management put | no payload | should return 400
     ✓ nurse management put | invalid payload | should return 400
     ✓ nurse management put | editing an it | should return 404
     ✗ nurse management put | edit with the existing nip | should return 409
      ↳  98% — ✓ 56 / ✗ 1
     ✓ medical record post | no header | should return 401
     ✓ medical record post | no payload | should return 400
     ✓ medical record post | invalid payload | should return 400
     ✓ medical record post | not exists identity number | should return 404
     ✓ medical record get | no header | should return 401
     ✓ login | invalid payload | should return 400
     ✓ login | not existing nip | should return 404
     ✓ medical patient post | no header | should return 401
     ✓ medical patient post | no payload | should return 400
     ✓ medical patient post | invalid payload | should return 400

     █ setup

       ✓ register | register with correct payload | should return 201
       ✓ register | register with correct payload | should return have a userId
       ✓ register | register with correct payload | should return have a nip
       ✓ register | register with correct payload | should return have a name
       ✓ register | register with correct payload | should return have an accessToken

     █ teardown

     checks.........................: 99.78% ✓ 3574965     ✗ 7706
     data_received..................: 508 MB 3.1 MB/s
     data_sent......................: 217 MB 1.3 MB/s
     grpc_req_duration..............: avg=7.24ms  min=94.92µs  med=2.3ms    max=1.46s   p(90)=11.73ms p(95)=21.74ms
     http_req_blocked...............: avg=2.91µs  min=394ns    med=1.93µs   max=88.95ms p(90)=3.5µs   p(95)=4.22µs
     http_req_connecting............: avg=316ns   min=0s       med=0s       max=88.83ms p(90)=0s      p(95)=0s
     http_req_duration..............: avg=84.94ms min=69.48µs  med=777.6µs  max=1m0s    p(90)=5.89ms  p(95)=13.39ms
       { expected_response:true }...: avg=28.74ms min=200.97µs med=856.96µs max=40.18s  p(90)=6.62ms  p(95)=14.03ms
     http_req_failed................: 13.07% ✓ 64012       ✗ 425474
     http_req_receiving.............: avg=52.47µs min=0s       med=30.31µs  max=66.82ms p(90)=61.65µs p(95)=84.53µs
     http_req_sending...............: avg=14.97µs min=2.67µs   med=10.43µs  max=16.19ms p(90)=20.44µs p(95)=29.61µs
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s       max=0s      p(90)=0s      p(95)=0s
     http_req_waiting...............: avg=84.87ms min=45.89µs  med=727.12µs max=1m0s    p(90)=5.79ms  p(95)=13.24ms
     http_reqs......................: 489486 2960.167011/s
     iteration_duration.............: avg=10.55s  min=105.87ms med=6.48s    max=1m33s   p(90)=20.37s  p(95)=1m0s
     iterations.....................: 2473   14.95547/s
     vus............................: 1018   min=5         max=1199
     vus_max........................: 1200   min=1200      max=1200


running (2m45.4s), 0000/1200 VUs, 2473 complete and 1011 interrupted iterations
default ✓ [======================================] 0825/1200 VUs  2m15s
ulila@AzmiLL5Laptop:/dir/w3/HaloSusterTestCasesPSW3B2$